jankaluza/qsimkit/CPU/Variants/msp430x14x.cpp
#ifndef U0BR0_
#define U0BR0_ 0x0074
#endif
#ifndef __msp430x14x
#define __msp430x14x 
#endif
#ifndef TXBUF_0_
#define TXBUF_0_ 0x0077
#endif
#ifndef MPY_
#define MPY_ 0x0130
#endif
#ifndef WDTCTL_
#define WDTCTL_ 0x0120
#endif
#ifndef URXSE
#define URXSE 0x08
#endif
#ifndef U0BR1_
#define U0BR1_ 0x0075
#endif
#ifndef UBR0_
#define UBR0_ 0x0074
#endif
#ifndef TXBUF_1_
#define TXBUF_1_ 0x007F
#endif
#ifndef __msp430_headers_flash_h
#define __msp430_headers_flash_h 
#endif
#ifndef SCG1
#define SCG1 0x0080
#endif
#ifndef TAIFG
#define TAIFG 0x0001
#endif
#ifndef SHT1_DIV192
#define SHT1_DIV192 SHT1_7
#endif
#ifndef UBR1_
#define UBR1_ 0x0075
#endif
#ifndef MSC
#define MSC 0x0080
#endif
#ifndef TA0CCTL0_
#define TA0CCTL0_ 0x0162
#endif
#ifndef MC_UPTO_CCR0
#define MC_UPTO_CCR0 MC_1
#endif
#ifndef INCH_VCC2
#define INCH_VCC2 11
#endif
#ifndef FN2
#define FN2 0x0004
#endif
#ifndef PENA
#define PENA 0x80
#endif
#ifndef TBSSEL0
#define TBSSEL0 0x0100
#endif
#ifndef TBSSEL1
#define TBSSEL1 0x0200
#endif
#ifndef TBSSEL2
#define TBSSEL2 0x0400
#endif
#ifndef TA0CCTL1_
#define TA0CCTL1_ 0x0164
#endif
#ifndef MC_UPDOWN
#define MC_UPDOWN MC_3
#endif
#ifndef CAREF_0
#define CAREF_0 0x00
#endif
#ifndef CAREF_1
#define CAREF_1 0x10
#endif
#ifndef CAREF_2
#define CAREF_2 0x20
#endif
#ifndef CAREF_3
#define CAREF_3 0x30
#endif
#ifndef __IOMACROS_H_
#define __IOMACROS_H_ 
#endif
#ifndef TA0CCTL2_
#define TA0CCTL2_ 0x0166
#endif
#ifndef U0CTL_
#define U0CTL_ 0x0070
#endif
#ifndef __msp430_headers_common_h
#define __msp430_headers_common_h 
#endif
#ifndef P1IES_
#define P1IES_ 0x0024
#endif
#ifndef CKPH
#define CKPH 0x80
#endif
#ifndef UCTL_
#define UCTL_ 0x0070
#endif
#ifndef REF2_5V
#define REF2_5V 0x0040
#endif
#ifndef CKPL
#define CKPL 0x40
#endif
#ifndef U0IE
#define U0IE IE1
#endif
#ifndef SHT1_DIV1024
#define SHT1_DIV1024 SHT1_12
#endif
#ifndef P4IN_
#define P4IN_ 0x001C
#endif
#ifndef __ASSEMBLER__
#define __ASSEMBLER__ 1
#endif
#ifndef MOD0
#define MOD0 0x01
#endif
#ifndef CARSEL
#define CARSEL 0x40
#endif
#ifndef XTS
#define XTS 0x40
#endif
#ifndef URCTL_
#define URCTL_ 0x0072
#endif
#ifndef SREF_VREF_AVSS
#define SREF_VREF_AVSS SREF_1
#endif
#ifndef __MSP430_HAS_PORT3__
#define __MSP430_HAS_PORT3__ 
#endif
#ifndef TBCCTL3_
#define TBCCTL3_ 0x0188
#endif
#ifndef ADC12_VECTOR
#define ADC12_VECTOR 14
#endif
#ifndef P5DIR_
#define P5DIR_ 0x0032
#endif
#ifndef TBSSEL_ACLK
#define TBSSEL_ACLK TBSSEL_1
#endif
#ifndef ADC12TOVIE
#define ADC12TOVIE 0x0004
#endif
#ifndef UCTL_0_
#define UCTL_0_ 0x0070
#endif
#ifndef __HAVE_BUILTIN_SETJMP__
#define __HAVE_BUILTIN_SETJMP__ 1
#endif
#ifndef SLSHR1
#define SLSHR1 0x0400
#endif
#ifndef TACCR0
#define TACCR0 TA0CCR0
#endif
#ifndef TACCR1
#define TACCR1 TA0CCR1
#endif
#ifndef TACCR2
#define TACCR2 TA0CCR2
#endif
#ifndef TA0R_
#define TA0R_ 0x0170
#endif
#ifndef UCTL_1_
#define UCTL_1_ 0x0078
#endif
#ifndef LISTEN
#define LISTEN 0x08
#endif
#ifndef INCH_11
#define INCH_11 11
#endif
#ifndef INCH_12
#define INCH_12 12
#endif
#ifndef INCH_13
#define INCH_13 13
#endif
#ifndef INCH_14
#define INCH_14 14
#endif
#ifndef INCH_15
#define INCH_15 15
#endif
#ifndef ADC12MCTL10_
#define ADC12MCTL10_ 0x008A
#endif
#ifndef SUMEXT_
#define SUMEXT_ 0x013E
#endif
#ifndef WDTIS_1
#define WDTIS_1 0x0001
#endif
#ifndef __msp430_have_port4
#define __msp430_have_port4 
#endif
#ifndef __msp430_have_usart1
#define __msp430_have_usart1 
#endif
#ifndef USART0TX_VECTOR
#define USART0TX_VECTOR 16
#endif
#ifndef __msp430_have_timerb7
#define __msp430_have_timerb7 
#endif
#ifndef SHT1_DIV384
#define SHT1_DIV384 SHT1_9
#endif
#ifndef P1OUT_
#define P1OUT_ 0x0021
#endif
#ifndef U1IFG
#define U1IFG IFG2
#endif
#ifndef OP2_
#define OP2_ 0x0138
#endif
#ifndef MC0
#define MC0 0x0010
#endif
#ifndef USART0RX_VECTOR
#define USART0RX_VECTOR 18
#endif
#ifndef BCSCTL1_
#define BCSCTL1_ 0x0057
#endif
#ifndef SEGWRT
#define SEGWRT 0x0080
#endif
#ifndef SYNC
#define SYNC 0x04
#endif
#ifndef P1SEL_
#define P1SEL_ 0x0026
#endif
#ifndef OUT
#define OUT 0x0004
#endif
#ifndef CM_POS
#define CM_POS CM_1
#endif
#ifndef TIMERA0_VECTOR
#define TIMERA0_VECTOR 12
#endif
#ifndef SHT1_DIV512
#define SHT1_DIV512 SHT1_10
#endif
#ifndef FN0
#define FN0 0x0001
#endif
#ifndef FN1
#define FN1 0x0002
#endif
#ifndef FN3
#define FN3 0x0008
#endif
#ifndef FN4
#define FN4 0x0010
#endif
#ifndef FN5
#define FN5 0x0020
#endif
#ifndef RESLO_
#define RESLO_ 0x013A
#endif
#ifndef __MSP430_HAS_UART1__
#define __MSP430_HAS_UART1__ 
#endif
#ifndef SELS
#define SELS 0x08
#endif
#ifndef CM_BOTH
#define CM_BOTH CM_3
#endif
#ifndef SHT0_DIV256
#define SHT0_DIV256 SHT0_8
#endif
#ifndef FSSEL_SMCLK
#define FSSEL_SMCLK FSSEL_2
#endif
#ifndef TASSEL_SMCLK
#define TASSEL_SMCLK TASSEL_2
#endif
#ifndef __SIZE_TYPE__
#define __SIZE_TYPE__ unsigned int
#endif
#ifndef __MSP430_HAS_PORT5__
#define __MSP430_HAS_PORT5__ 
#endif
#ifndef UBR00_
#define UBR00_ 0x0074
#endif
#ifndef TBCLR
#define TBCLR 0x0004
#endif
#ifndef UTCTL0_
#define UTCTL0_ 0x0071
#endif
#ifndef CAIES
#define CAIES 0x04
#endif
#ifndef UBR01_
#define UBR01_ 0x007C
#endif
#ifndef UTCTL1_
#define UTCTL1_ 0x0079
#endif
#ifndef U0TCTL_
#define U0TCTL_ 0x0071
#endif
#ifndef CAIFG
#define CAIFG 0x01
#endif
#ifndef TXEPT
#define TXEPT 0x01
#endif
#ifndef UBR0_0_
#define UBR0_0_ 0x0074
#endif
#ifndef ADC12SC
#define ADC12SC 0x0001
#endif
#ifndef CCTL1
#define CCTL1 TA0CCTL1
#endif
#ifndef SSEL_SMCLK
#define SSEL_SMCLK SSEL_2
#endif
#ifndef LPM0
#define LPM0 CPUOFF
#endif
#ifndef LPM1
#define LPM1 SCG0+CPUOFF
#endif
#ifndef LPM2
#define LPM2 SCG1+CPUOFF
#endif
#ifndef LPM3
#define LPM3 SCG1+SCG0+CPUOFF
#endif
#ifndef LPM4
#define LPM4 SCG1+SCG0+OSCOFF+CPUOFF
#endif
#ifndef UBR0_1_
#define UBR0_1_ 0x007C
#endif
#ifndef SHT02
#define SHT02 0x0400
#endif
#ifndef SHT03
#define SHT03 0x0800
#endif
#ifndef ADC12MCTL12_
#define ADC12MCTL12_ 0x008C
#endif
#ifndef U0MCTL_
#define U0MCTL_ 0x0073
#endif
#ifndef TBIE
#define TBIE 0x0002
#endif
#ifndef U0TXBUF_
#define U0TXBUF_ 0x0077
#endif
#ifndef __GNUC_PATCHLEVEL__
#define __GNUC_PATCHLEVEL__ 3
#endif
#ifndef SELM_LFXTCLK
#define SELM_LFXTCLK SELM_3
#endif
#ifndef TIMERB0_VECTOR
#define TIMERB0_VECTOR 26
#endif
#ifndef TBIFG
#define TBIFG 0x0001
#endif
#ifndef TBCTL_
#define TBCTL_ 0x0180
#endif
#ifndef ADC12MEM2_
#define ADC12MEM2_ 0x0144
#endif
#ifndef RESHI_
#define RESHI_ 0x013C
#endif
#ifndef OUTMOD_RESET
#define OUTMOD_RESET OUTMOD_5
#endif
#ifndef FSSEL0
#define FSSEL0 0x0040
#endif
#ifndef FSSEL1
#define FSSEL1 0x0080
#endif
#ifndef CONSEQ_REPEAT_SEQUENCE
#define CONSEQ_REPEAT_SEQUENCE CONSEQ_3
#endif
#ifndef P4DIR_
#define P4DIR_ 0x001E
#endif
#ifndef INCH_A1
#define INCH_A1 1
#endif
#ifndef INCH_A2
#define INCH_A2 2
#endif
#ifndef INCH_A3
#define INCH_A3 3
#endif
#ifndef INCH_A4
#define INCH_A4 4
#endif
#ifndef INCH_A5
#define INCH_A5 5
#endif
#ifndef INCH_A6
#define INCH_A6 6
#endif
#ifndef SHP
#define SHP 0x0200
#endif
#ifndef P2CA0
#define P2CA0 0x04
#endif
#ifndef P2CA1
#define P2CA1 0x08
#endif
#ifndef ACCVIFG
#define ACCVIFG 0x0004
#endif
#ifndef __msp430_headers_clock_h
#define __msp430_headers_clock_h 
#endif
#ifndef TACTL
#define TACTL TA0CTL
#endif
#ifndef ADC12CTL0_
#define ADC12CTL0_ 0x01A0
#endif
#ifndef CM_NEG
#define CM_NEG CM_2
#endif
#ifndef FXKEY
#define FXKEY 0x3300
#endif
#ifndef DIVA_DIV2
#define DIVA_DIV2 DIVA_1
#endif
#ifndef DIVA_DIV4
#define DIVA_DIV4 DIVA_2
#endif
#ifndef SCS
#define SCS 0x0800
#endif
#ifndef REFON
#define REFON 0x0020
#endif
#ifndef BIT1
#define BIT1 0x0002
#endif
#ifndef BIT2
#define BIT2 0x0004
#endif
#ifndef BIT3
#define BIT3 0x0008
#endif
#ifndef BIT4
#define BIT4 0x0010
#endif
#ifndef BIT5
#define BIT5 0x0020
#endif
#ifndef BIT7
#define BIT7 0x0080
#endif
#ifndef BIT8
#define BIT8 0x0100
#endif
#ifndef BIT9
#define BIT9 0x0200
#endif
#ifndef BITA
#define BITA 0x0400
#endif
#ifndef BITB
#define BITB 0x0800
#endif
#ifndef BITC
#define BITC 0x1000
#endif
#ifndef BITD
#define BITD 0x2000
#endif
#ifndef BITE
#define BITE 0x4000
#endif
#ifndef BITF
#define BITF 0x8000
#endif
#ifndef SELM_XT2CLK
#define SELM_XT2CLK SELM_2
#endif
#ifndef SCG0
#define SCG0 0x0040
#endif
#ifndef WDTCNTCL
#define WDTCNTCL 0x0008
#endif
#ifndef TBR_
#define TBR_ 0x0190
#endif
#ifndef ADC12MCTL_
#define ADC12MCTL_ 0x0080
#endif
#ifndef SHT1_DIV768
#define SHT1_DIV768 SHT1_11
#endif
#ifndef MOD1
#define MOD1 0x02
#endif
#ifndef MOD2
#define MOD2 0x04
#endif
#ifndef MOD3
#define MOD3 0x08
#endif
#ifndef MOD4
#define MOD4 0x10
#endif
#ifndef CHAR
#define CHAR 0x10
#endif
#ifndef SPB
#define SPB 0x20
#endif
#ifndef SREF_VEREF_VEREF
#define SREF_VEREF_VEREF SREF_6
#endif
#ifndef TAIV_CCR2
#define TAIV_CCR2 0x04
#endif
#ifndef NMI_VECTOR
#define NMI_VECTOR 28
#endif
#ifndef TAIV_CCR1
#define TAIV_CCR1 0x02
#endif
#ifndef CCTL0_
#define CCTL0_ TA0CCTL0_
#endif
#ifndef MPYS_
#define MPYS_ 0x0132
#endif
#ifndef ADC12IFG_
#define ADC12IFG_ 0x01A4
#endif
#ifndef OUTMOD0
#define OUTMOD0 0x0020
#endif
#ifndef SREF_VREF_VEREF
#define SREF_VREF_VEREF SREF_5
#endif
#ifndef CCTL1_
#define CCTL1_ TA0CCTL1_
#endif
#ifndef RXERR
#define RXERR 0x01
#endif
#ifndef CCTL2_
#define CCTL2_ TA0CCTL2_
#endif
#ifndef STC
#define STC 0x02
#endif
#ifndef SHT0_DIV8
#define SHT0_DIV8 SHT0_1
#endif
#ifndef U1TXBUF_
#define U1TXBUF_ 0x007F
#endif
#ifndef SHT0_DIV128
#define SHT0_DIV128 SHT0_6
#endif
#ifndef TBIV_NONE
#define TBIV_NONE 0x00
#endif
#ifndef TASSEL_INCLK
#define TASSEL_INCLK TASSEL_3
#endif
#ifndef P3IN_
#define P3IN_ 0x0018
#endif
#ifndef UTCTL_0_
#define UTCTL_0_ 0x0071
#endif
#ifndef P2IFG_
#define P2IFG_ 0x002B
#endif
#ifndef TIMERA1_VECTOR
#define TIMERA1_VECTOR 10
#endif
#ifndef UART1TX_VECTOR
#define UART1TX_VECTOR USART1TX_VECTOR
#endif
#ifndef UTCTL_1_
#define UTCTL_1_ 0x0079
#endif
#ifndef TASSEL_ACLK
#define TASSEL_ACLK TASSEL_1
#endif
#ifndef TA0CCR0_
#define TA0CCR0_ 0x0172
#endif
#ifndef TACTL_
#define TACTL_ TA0CTL_
#endif
#ifndef CCR0_
#define CCR0_ TA0CCR0_
#endif
#ifndef SHS0
#define SHS0 0x0400
#endif
#ifndef TA0CCR1_
#define TA0CCR1_ 0x0174
#endif
#ifndef CCR1_
#define CCR1_ TA0CCR1_
#endif
#ifndef OUTMOD_OUT
#define OUTMOD_OUT OUTMOD_0
#endif
#ifndef U1TCTL_
#define U1TCTL_ 0x0079
#endif
#ifndef P3DIR_
#define P3DIR_ 0x001A
#endif
#ifndef DCO0
#define DCO0 0x20
#endif
#ifndef DCO1
#define DCO1 0x40
#endif
#ifndef DCO2
#define DCO2 0x80
#endif
#ifndef TA0CCR2_
#define TA0CCR2_ 0x0176
#endif
#ifndef DCOR
#define DCOR 0x01
#endif
#ifndef P6OUT_
#define P6OUT_ 0x0035
#endif
#ifndef SHT0_DIV192
#define SHT0_DIV192 SHT0_7
#endif
#ifndef WDT_VECTOR
#define WDT_VECTOR 20
#endif
#ifndef URCTL_0_
#define URCTL_0_ 0x0072
#endif
#ifndef SELM0
#define SELM0 0x40
#endif
#ifndef SELM1
#define SELM1 0x80
#endif
#ifndef RXBUF_
#define RXBUF_ 0x0076
#endif
#ifndef U1MCTL_
#define U1MCTL_ 0x007B
#endif
#ifndef URCTL_1_
#define URCTL_1_ 0x007A
#endif
#ifndef CAP
#define CAP 0x0100
#endif
#ifndef U0IFG
#define U0IFG IFG1
#endif
#ifndef P6SEL_
#define P6SEL_ 0x0037
#endif
#ifndef __USER_LABEL_PREFIX__
#define __USER_LABEL_PREFIX__ 
#endif
#ifndef SHT1_DIV16
#define SHT1_DIV16 SHT1_2
#endif
#ifndef ADC12SSEL_ACLK
#define ADC12SSEL_ACLK ADC12SSEL_1
#endif
#ifndef CCI
#define CCI 0x0008
#endif
#ifndef MSH
#define MSH 0x0080
#endif
#ifndef XT2OFF
#define XT2OFF 0x80
#endif
#ifndef SHT1_DIV32
#define SHT1_DIV32 SHT1_3
#endif
#ifndef __STDC_HOSTED__
#define __STDC_HOSTED__ 1
#endif
#ifndef SHT0_DIV16
#define SHT0_DIV16 SHT0_2
#endif
#ifndef OUTMOD_SET
#define OUTMOD_SET OUTMOD_1
#endif
#ifndef OUTMOD_RESET_SET
#define OUTMOD_RESET_SET OUTMOD_7
#endif
#ifndef MC_STOP
#define MC_STOP MC_0
#endif
#ifndef SHT0_DIV32
#define SHT0_DIV32 SHT0_3
#endif
#ifndef __msp430_headers_mpy_h
#define __msp430_headers_mpy_h 
#endif
#ifndef TASSEL_TACLK
#define TASSEL_TACLK TASSEL_0
#endif
#ifndef SHT1_DIV64
#define SHT1_DIV64 SHT1_4
#endif
#ifndef ID_DIV1
#define ID_DIV1 ID_0
#endif
#ifndef ID_DIV2
#define ID_DIV2 ID_1
#endif
#ifndef ID_DIV4
#define ID_DIV4 ID_2
#endif
#ifndef ID_DIV8
#define ID_DIV8 ID_3
#endif
#ifndef CONSEQ_SEQUENCE
#define CONSEQ_SEQUENCE CONSEQ_1
#endif
#ifndef TACLR
#define TACLR 0x0004
#endif
#ifndef SLSHR0
#define SLSHR0 0x0200
#endif
#ifndef SHT0_DIV384
#define SHT0_DIV384 SHT0_9
#endif
#ifndef __MSP430_HAS_FLASH__
#define __MSP430_HAS_FLASH__ 
#endif
#ifndef MERAS
#define MERAS 0x0004
#endif
#ifndef WDTNMI
#define WDTNMI 0x0020
#endif
#ifndef __MSP430__
#define __MSP430__ 1
#endif
#ifndef SHT0_DIV64
#define SHT0_DIV64 SHT0_4
#endif
#ifndef RXWAKE
#define RXWAKE 0x02
#endif
#ifndef U0RCTL_
#define U0RCTL_ 0x0072
#endif
#ifndef ADC12CTL1_
#define ADC12CTL1_ 0x01A2
#endif
#ifndef SHT1_DIV96
#define SHT1_DIV96 SHT1_5
#endif
#ifndef P4SEL_
#define P4SEL_ 0x001F
#endif
#ifndef ADC12ON
#define ADC12ON 0x0010
#endif
#ifndef __WCHAR_TYPE__
#define __WCHAR_TYPE__ int
#endif
#ifndef CAEX
#define CAEX 0x80
#endif
#ifndef P6IN_
#define P6IN_ 0x0034
#endif
#ifndef UMCTL_0_
#define UMCTL_0_ 0x0073
#endif
#ifndef SHT0_DIV96
#define SHT0_DIV96 SHT0_5
#endif
#ifndef CM0
#define CM0 0x4000
#endif
#ifndef CM1
#define CM1 0x8000
#endif
#ifndef ADC12DIV0
#define ADC12DIV0 0x0020
#endif
#ifndef ADC12DIV1
#define ADC12DIV1 0x0040
#endif
#ifndef ADC12DIV2
#define ADC12DIV2 0x0080
#endif
#ifndef UMCTL_1_
#define UMCTL_1_ 0x007B
#endif
#ifndef WRT
#define WRT 0x0040
#endif
#ifndef P1IFG_
#define P1IFG_ 0x0023
#endif
#ifndef INCH_VEREF_PLUS
#define INCH_VEREF_PLUS 8
#endif
#ifndef CAREF_025
#define CAREF_025 CAREF_1
#endif
#ifndef CONSEQ_SINGLE
#define CONSEQ_SINGLE CONSEQ_0
#endif
#ifndef WDTPW
#define WDTPW 0x5A00
#endif
#ifndef CAREF0
#define CAREF0 0x10
#endif
#ifndef CAREF1
#define CAREF1 0x20
#endif
#ifndef SHT0_DIV512
#define SHT0_DIV512 SHT0_10
#endif
#ifndef U0ME
#define U0ME ME1
#endif
#ifndef CAIE
#define CAIE 0x02
#endif
#ifndef SREF_VEREF_AVSS
#define SREF_VEREF_AVSS SREF_2
#endif
#ifndef COV
#define COV 0x0002
#endif
#ifndef OUTMOD_TOGGLE
#define OUTMOD_TOGGLE OUTMOD_4
#endif
#ifndef P2DIR_
#define P2DIR_ 0x002A
#endif
#ifndef __MSP430_HAS_PORT2__
#define __MSP430_HAS_PORT2__ 
#endif
#ifndef TBIV_CCR5
#define TBIV_CCR5 0x0A
#endif
#ifndef UART0TX_VECTOR
#define UART0TX_VECTOR USART0TX_VECTOR
#endif
#ifndef P5OUT_
#define P5OUT_ 0x0031
#endif
#ifndef CAREF_050
#define CAREF_050 CAREF_2
#endif
#ifndef SHS_ADC12SC
#define SHS_ADC12SC SHS_0
#endif
#ifndef __MSP430_HAS_MPY__
#define __MSP430_HAS_MPY__ 
#endif
#ifndef __INT_MAX__
#define __INT_MAX__ 32767
#endif
#ifndef SHT1_DIV256
#define SHT1_DIV256 SHT1_8
#endif
#ifndef MACS_
#define MACS_ 0x0136
#endif
#ifndef TXBUF0_
#define TXBUF0_ 0x0077
#endif
#ifndef CNTL0
#define CNTL0 0x0800
#endif
#ifndef CNTL1
#define CNTL1 0x1000
#endif
#ifndef TBIV_
#define TBIV_ 0x011E
#endif
#ifndef TBCCR0_
#define TBCCR0_ 0x0192
#endif
#ifndef FWKEY
#define FWKEY 0xA500
#endif
#ifndef TXBUF1_
#define TXBUF1_ 0x007F
#endif
#ifndef UART0RX_VECTOR
#define UART0RX_VECTOR USART0RX_VECTOR
#endif
#ifndef __msp430_headers_adc12_h
#define __msp430_headers_adc12_h 
#endif
#ifndef SSEL0
#define SSEL0 0x10
#endif
#ifndef SSEL1
#define SSEL1 0x20
#endif
#ifndef TBIV_OVERFLOW
#define TBIV_OVERFLOW 0x0E
#endif
#ifndef P5SEL_
#define P5SEL_ 0x0033
#endif
#ifndef BCSCTL2_
#define BCSCTL2_ 0x0058
#endif
#ifndef KEYV
#define KEYV 0x0002
#endif
#ifndef P2IE_
#define P2IE_ 0x002D
#endif
#ifndef PEV
#define PEV 0x40
#endif
#ifndef CAON
#define CAON 0x08
#endif
#ifndef LOCK
#define LOCK 0x0010
#endif
#ifndef SHT0_DIV1024
#define SHT0_DIV1024 SHT0_12
#endif
#ifndef SHS_TBCCR0
#define SHS_TBCCR0 SHS_2
#endif
#ifndef SHS_TBCCR1
#define SHS_TBCCR1 SHS_3
#endif
#ifndef ADC12MCTL11_
#define ADC12MCTL11_ 0x008B
#endif
#ifndef RXBUF0_
#define RXBUF0_ 0x0076
#endif
#ifndef CAPD7
#define CAPD7 0x80
#endif
#ifndef DIVM_DIV1
#define DIVM_DIV1 DIVM_0
#endif
#ifndef DIVM_DIV2
#define DIVM_DIV2 DIVM_1
#endif
#ifndef DIVM_DIV4
#define DIVM_DIV4 DIVM_2
#endif
#ifndef DIVM_DIV8
#define DIVM_DIV8 DIVM_3
#endif
#ifndef RXBUF1_
#define RXBUF1_ 0x007E
#endif
#ifndef __WINT_TYPE__
#define __WINT_TYPE__ unsigned int
#endif
#ifndef __GNUC__
#define __GNUC__ 3
#endif
#ifndef ADC12MCTL13_
#define ADC12MCTL13_ 0x008D
#endif
#ifndef SWRST
#define SWRST 0x01
#endif
#ifndef DIVA_DIV1
#define DIVA_DIV1 DIVA_0
#endif
#ifndef CAOUT
#define CAOUT 0x01
#endif
#ifndef __MSP430_HAS_BASIC_CLOCK__
#define __MSP430_HAS_BASIC_CLOCK__ 
#endif
#ifndef ADC12SSEL_ADC12OSC
#define ADC12SSEL_ADC12OSC ADC12SSEL_0
#endif
#ifndef ADC12MCTL14_
#define ADC12MCTL14_ 0x008E
#endif
#ifndef SELM_DCOCLK
#define SELM_DCOCLK SELM_0
#endif
#ifndef PORT2_VECTOR
#define PORT2_VECTOR 2
#endif
#ifndef ENC
#define ENC 0x0002
#endif
#ifndef __msp430_headers_gpio_h
#define __msp430_headers_gpio_h 
#endif
#ifndef U1IE
#define U1IE IE2
#endif
#ifndef CSTARTADD1
#define CSTARTADD1 0x2000
#endif
#ifndef CSTARTADD2
#define CSTARTADD2 0x4000
#endif
#ifndef CSTARTADD3
#define CSTARTADD3 0x8000
#endif
#ifndef TBSSEL_TBCLK
#define TBSSEL_TBCLK TBSSEL_0
#endif
#ifndef FSSEL_0
#define FSSEL_0 0x0000
#endif
#ifndef FSSEL_1
#define FSSEL_1 0x0040
#endif
#ifndef FSSEL_2
#define FSSEL_2 0x0080
#endif
#ifndef FSSEL_3
#define FSSEL_3 0x00C0
#endif
#ifndef DIVA_DIV8
#define DIVA_DIV8 DIVA_3
#endif
#ifndef ADC12MCTL15_
#define ADC12MCTL15_ 0x008F
#endif
#ifndef __msp430_have_port1
#define __msp430_have_port1 
#endif
#ifndef __msp430_have_port2
#define __msp430_have_port2 
#endif
#ifndef __msp430_have_port3
#define __msp430_have_port3 
#endif
#ifndef CCIFG
#define CCIFG 0x0001
#endif
#ifndef __msp430_have_port5
#define __msp430_have_port5 
#endif
#ifndef __msp430_have_port6
#define __msp430_have_port6 
#endif
#ifndef ADC12MEM10_
#define ADC12MEM10_ 0x0154
#endif
#ifndef CCIE
#define CCIE 0x0010
#endif
#ifndef MAC_
#define MAC_ 0x0134
#endif
#ifndef __MSP430_HAS_UART0__
#define __MSP430_HAS_UART0__ 
#endif
#ifndef EOS
#define EOS 0x80
#endif
#ifndef CACTL2_
#define CACTL2_ 0x005A
#endif
#ifndef IFG2_
#define IFG2_ 0x0003
#endif
#ifndef __MSP430_HAS_PORT4__
#define __MSP430_HAS_PORT4__ 
#endif
#ifndef ADC12MEM11_
#define ADC12MEM11_ 0x0156
#endif
#ifndef ADC12MCTL
#define ADC12MCTL ADC12MCTL_
#endif
#ifndef ADC12BUSY
#define ADC12BUSY 0x0001
#endif
#ifndef INCH_10
#define INCH_10 10
#endif
#ifndef ADC12MEM12_
#define ADC12MEM12_ 0x0158
#endif
#ifndef P2IN_
#define P2IN_ 0x0028
#endif
#ifndef SHT0_DIV768
#define SHT0_DIV768 SHT0_11
#endif
#ifndef ADC12MEM13_
#define ADC12MEM13_ 0x015A
#endif
#ifndef U1ME
#define U1ME ME2
#endif
#ifndef ADC12MEM14_
#define ADC12MEM14_ 0x015C
#endif
#ifndef FE
#define FE 0x80
#endif
#ifndef ADC12OVIE
#define ADC12OVIE 0x0008
#endif
#ifndef ADC12MEM15_
#define ADC12MEM15_ 0x015E
#endif
#ifndef TACCR0_
#define TACCR0_ TA0CCR0_
#endif
#ifndef ME1_
#define ME1_ 0x0004
#endif
#ifndef TAIE
#define TAIE 0x0002
#endif
#ifndef GIE
#define GIE 0x0008
#endif
#ifndef TAIV
#define TAIV TA0IV
#endif
#ifndef CLLD0
#define CLLD0 0x0200
#endif
#ifndef CLLD1
#define CLLD1 0x0400
#endif
#ifndef OUTMOD_SET_RESET
#define OUTMOD_SET_RESET OUTMOD_3
#endif
#ifndef ADC12IE_
#define ADC12IE_ 0x01A6
#endif
#ifndef TACCR1_
#define TACCR1_ TA0CCR1_
#endif
#ifndef U1RCTL_
#define U1RCTL_ 0x007A
#endif
#ifndef P1DIR_
#define P1DIR_ 0x0022
#endif
#ifndef ADC12MEM_
#define ADC12MEM_ 0x0140
#endif
#ifndef CONSEQ_REPEAT_SINGLE
#define CONSEQ_REPEAT_SINGLE CONSEQ_2
#endif
#ifndef WDTIS0
#define WDTIS0 0x0001
#endif
#ifndef WDTIS1
#define WDTIS1 0x0002
#endif
#ifndef BLKWRT
#define BLKWRT 0x0080
#endif
#ifndef TACCR2_
#define TACCR2_ TA0CCR2_
#endif
#ifndef CONSEQ0
#define CONSEQ0 0x0002
#endif
#ifndef CONSEQ1
#define CONSEQ1 0x0004
#endif
#ifndef XT5V
#define XT5V 0x08
#endif
#ifndef P4OUT_
#define P4OUT_ 0x001D
#endif
#ifndef OUTMOD_TOGGLE_SET
#define OUTMOD_TOGGLE_SET OUTMOD_6
#endif
#ifndef SSEL_UCLKI
#define SSEL_UCLKI SSEL_0
#endif
#ifndef CCTL0
#define CCTL0 TA0CCTL0
#endif
#ifndef CCTL2
#define CCTL2 TA0CCTL2
#endif
#ifndef SHT00
#define SHT00 0x0100
#endif
#ifndef SHT01
#define SHT01 0x0200
#endif
#ifndef CCR0
#define CCR0 TA0CCR0
#endif
#ifndef CCR1
#define CCR1 TA0CCR1
#endif
#ifndef CCR2
#define CCR2 TA0CCR2
#endif
#ifndef URXWIE
#define URXWIE 0x04
#endif
#ifndef MC_CONT
#define MC_CONT MC_2
#endif
#ifndef __msp430_headers_timerb_h__
#define __msp430_headers_timerb_h__ 
#endif
#ifndef SHT10
#define SHT10 0x1000
#endif
#ifndef SHT11
#define SHT11 0x2000
#endif
#ifndef SHT12
#define SHT12 0x4000
#endif
#ifndef SHT13
#define SHT13 0x8000
#endif
#ifndef MSP430_NO_HW_MUL
#define MSP430_NO_HW_MUL 1
#endif
#ifndef RSEL0
#define RSEL0 0x01
#endif
#ifndef RSEL1
#define RSEL1 0x02
#endif
#ifndef RSEL2
#define RSEL2 0x04
#endif
#ifndef FSSEL_MCLK
#define FSSEL_MCLK FSSEL_1
#endif
#ifndef INCH_3
#define INCH_3 3
#endif
#ifndef ADC12MCTL0_
#define ADC12MCTL0_ ADC12MCTL_
#endif
#ifndef SHT0_DIV4
#define SHT0_DIV4 SHT0_0
#endif
#ifndef ADC_VECTOR
#define ADC_VECTOR ADC12_VECTOR
#endif
#ifndef TAIV_NONE
#define TAIV_NONE 0x00
#endif
#ifndef MM
#define MM 0x02
#endif
#ifndef ADC12MCTL1_
#define ADC12MCTL1_ 0x0081
#endif
#ifndef ID0
#define ID0 0x0040
#endif
#ifndef ID1
#define ID1 0x0080
#endif
#ifndef CCIS0
#define CCIS0 0x1000
#endif
#ifndef CCIS1
#define CCIS1 0x2000
#endif
#ifndef __MSP430_HAS_PORT6__
#define __MSP430_HAS_PORT6__ 
#endif
#ifndef UBR10_
#define UBR10_ 0x0075
#endif
#ifndef ADC12MCTL2_
#define ADC12MCTL2_ 0x0082
#endif
#ifndef TAR
#define TAR TA0R
#endif
#ifndef __USING_SJLJ_EXCEPTIONS__
#define __USING_SJLJ_EXCEPTIONS__ 1
#endif
#ifndef EMEX
#define EMEX 0x0020
#endif
#ifndef OE
#define OE 0x20
#endif
#ifndef TBIV_CCR2
#define TBIV_CCR2 0x04
#endif
#ifndef UBR11_
#define UBR11_ 0x007D
#endif
#ifndef ADC12MCTL3_
#define ADC12MCTL3_ 0x0083
#endif
#ifndef INCH_VEREF_MINUS
#define INCH_VEREF_MINUS 9
#endif
#ifndef SSEL_0
#define SSEL_0 0x00
#endif
#ifndef SSEL_1
#define SSEL_1 0x10
#endif
#ifndef SSEL_2
#define SSEL_2 0x20
#endif
#ifndef SSEL_3
#define SSEL_3 0x30
#endif
#ifndef PE
#define PE 0x40
#endif
#ifndef ADC12MCTL4_
#define ADC12MCTL4_ 0x0084
#endif
#ifndef TAR_
#define TAR_ TA0R_
#endif
#ifndef CCR2_
#define CCR2_ TA0CCR2_
#endif
#ifndef WDTTMSEL
#define WDTTMSEL 0x0010
#endif
#ifndef ADC12MCTL5_
#define ADC12MCTL5_ 0x0085
#endif
#ifndef RXBUF_0_
#define RXBUF_0_ 0x0076
#endif
#ifndef ISSH
#define ISSH 0x0100
#endif
#ifndef DIVS_DIV1
#define DIVS_DIV1 DIVS_0
#endif
#ifndef DIVS_DIV2
#define DIVS_DIV2 DIVS_1
#endif
#ifndef DIVS_DIV4
#define DIVS_DIV4 DIVS_2
#endif
#ifndef DIVS_DIV8
#define DIVS_DIV8 DIVS_3
#endif
#ifndef ADC12MCTL6_
#define ADC12MCTL6_ 0x0086
#endif
#ifndef RXBUF_1_
#define RXBUF_1_ 0x007E
#endif
#ifndef CAREF_OFF
#define CAREF_OFF CAREF_0
#endif
#ifndef ERASE
#define ERASE 0x0002
#endif
#ifndef ADC12MCTL7_
#define ADC12MCTL7_ 0x0087
#endif
#ifndef __MSP430_HAS_WDT__
#define __MSP430_HAS_WDT__ 
#endif
#ifndef TA0CTL_
#define TA0CTL_ 0x0160
#endif
#ifndef ADC12MCTL8_
#define ADC12MCTL8_ 0x0088
#endif
#ifndef ADC12MCTL9_
#define ADC12MCTL9_ 0x0089
#endif
#ifndef P5IN_
#define P5IN_ 0x0030
#endif
#ifndef UTCTL_
#define UTCTL_ 0x0071
#endif
#ifndef UART1RX_VECTOR
#define UART1RX_VECTOR USART1RX_VECTOR
#endif
#ifndef TXBUF_
#define TXBUF_ 0x0077
#endif
#ifndef INCH_TEMP
#define INCH_TEMP 10
#endif
#ifndef URCTL0_
#define URCTL0_ 0x0072
#endif
#ifndef TBSSEL_INCLK
#define TBSSEL_INCLK TBSSEL_3
#endif
#ifndef CSTARTADD0
#define CSTARTADD0 0x1000
#endif
#ifndef URCTL1_
#define URCTL1_ 0x007A
#endif
#ifndef UCTL0_
#define UCTL0_ 0x0070
#endif
#ifndef ADC12SSEL0
#define ADC12SSEL0 0x0008
#endif
#ifndef ADC12SSEL1
#define ADC12SSEL1 0x0010
#endif
#ifndef UMCTL_
#define UMCTL_ 0x0073
#endif
#ifndef OUTMOD1
#define OUTMOD1 0x0040
#endif
#ifndef OUTMOD2
#define OUTMOD2 0x0080
#endif
#ifndef UCTL1_
#define UCTL1_ 0x0078
#endif
#ifndef ADC12IV_
#define ADC12IV_ 0x01A8
#endif
#ifndef WAIT
#define WAIT 0x0008
#endif
#ifndef OUTMOD_TOGGLE_RESET
#define OUTMOD_TOGGLE_RESET OUTMOD_2
#endif
#ifndef FSSEL_ACLK
#define FSSEL_ACLK FSSEL_0
#endif
#ifndef IE2_
#define IE2_ 0x0001
#endif
#ifndef SREF_AVCC_AVSS
#define SREF_AVCC_AVSS SREF_0
#endif
#ifndef UMCTL0_
#define UMCTL0_ 0x0073
#endif
#ifndef TBCLGRP0
#define TBCLGRP0 0x2000
#endif
#ifndef TBCLGRP1
#define TBCLGRP1 0x4000
#endif
